// Ваша задача:
// Написать функцию calculateAverageSalaries, которая принимает объект company и
// возвращает новый объект, где ключи — это названия отделов, а значения — средняя
// зарплата сотрудников этих отделов.
// Если отдел содержит вложенные отделы, средняя зарплата должна учитывать сотрудников
// всех вложенных отделов.

// Результат должен быть представлен в формате:
// {
//     "sales": 800,       // средняя зарплата в отделе продаж
//     "development": 1700 // средняя зарплата в от// Ваша задача:
// Написать функцию calculateAverageSalaries, которая принимает объект company и
// возвращает новый объект, где ключи — это названия отделов, а значения — средняя
// зарплата сотрудников этих отделов.
// Если отдел содержит вложенные отделы, средняя зарплата должна учитывать сотрудников
// всех вложенных отделов.

// Результат должен быть представлен в формате:
// {
//     "sales": 800,       // средняя зарплата в отделе продаж
//     "development": 1700 // средняя зарплата в от
